posts/dwm/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Holdbar">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hacking DWM : Holdbar | Hayden's Tinkering Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://hsszyman.github.io/posts/dwm/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Hayden Szymanski">
<link rel="prev" href="../first-blog-post/" title="First Blog Post" type="text/html">
<meta property="og:site_name" content="Hayden's Tinkering Blog">
<meta property="og:title" content="Hacking DWM : Holdbar">
<meta property="og:url" content="https://hsszyman.github.io/posts/dwm/">
<meta property="og:description" content="Holdbar">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-06-27T18:14:25-04:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="dwm">
<meta property="article:tag" content="Linux">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://hsszyman.github.io/">

            <span id="blog-title">Hayden's Tinkering Blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Hacking DWM : Holdbar</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Hayden Szymanski
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-06-27T18:14:25-04:00" itemprop="datePublished" title="2019-06-27 18:14">2019-06-27 18:14</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org47fcbb3" class="outline-2">
<h2 id="org47fcbb3">DWM In a Nutshell</h2>
<div class="outline-text-2" id="text-org47fcbb3">
<p>
Dwm is a window manager for Linux, and while not as fully featured as something like I3, it is much more configurable. While most window managers rely on customization through a seperate config file dwm instead opts for users to edit its source code directly. Initially this seems like an absurd requirement to configure your system, but it's a lot more manageable when the source code is less than 2000 lines.<br></p>

<p>
In a later blog post I'll go into more details on the unique aspects of dwm, but for today let's look at hacking it.<br></p>
</div>
</div>


<div id="outline-container-orgb7bc4fc" class="outline-2">
<h2 id="orgb7bc4fc">Organization</h2>
<div class="outline-text-2" id="text-orgb7bc4fc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Filename</th>
<th scope="col" class="org-left">Role</th>
<th scope="col" class="org-left">Difficulty</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">config.h</td>
<td class="org-left">quick configuration meant to be edited frequently</td>
<td class="org-left">Easy to configure</td>
</tr>
<tr>
<td class="org-left">dwm.c</td>
<td class="org-left">More in depth configuration, being the main source code</td>
<td class="org-left">Difficult, but rewarding</td>
</tr>
</tbody>
</table>
<p>
=<br></p>



<p>
Typically you'll be using config.h when hacking to do things like change keybindings, or small tweaks such as disabling size hints.<br></p>

<p>
For patches this often won't cut it, and sometimes you'll have to jump into dwm.c which holds both dwm's function declerations and implementations<br></p>
</div>
</div>

<div id="outline-container-org0e1dab7" class="outline-2">
<h2 id="org0e1dab7">Coming up with a problem to solve</h2>
<div class="outline-text-2" id="text-org0e1dab7">
<p>
One feature I try to implement on any new window manager I use is only showing the status bar when I'm holding the manager's Mod key, as well as painting that status bar over the rest of the display. This will let me save space while at the same time giving me frequent access to the information on the status bar.<br></p>

<p>
In short, we want the bar only to be seen when held, what I call a holdbar.<br></p>
</div>
</div>

<div id="outline-container-orgf306859" class="outline-2">
<h2 id="orgf306859">Setting up the environment</h2>
<div class="outline-text-2" id="text-orgf306859">
<p>
– to be continued<br></p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/dwm/" rel="tag">dwm</a></li>
            <li><a class="tag p-category" href="../../categories/linux/" rel="tag">Linux</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../first-blog-post/" rel="prev" title="First Blog Post">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:hsszyman@gmail.com">Hayden Szymanski</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
